# EA_ConvX2Doc

## Description
Converts value from X unit to document unit and returns the result as a real number.

```pascal
FUNCTION EA_ConvX2Doc(
				unitType : INTEGER;
				value    : REAL): REAL;
```

```python
def vs.EA_ConvX2Doc(unitType, value):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|unitType|INTEGER|   |
|value|REAL|   |

## Version
Availability: from Vectorworks 2016

## Category
* EnergyAnalysis Interface Library